sparkfun/Pioneer_IoT_Kit_Shield/Firmware/BLE_To_RPi/BLE_To_RPi.cydsn/Generated_Source/PSoC6/CapSense_Structure.h
/*******************************************************************************
* Defines Data Structure Macro helpers
*******************************************************************************/

/*******************************************************************************
* Determines the widget specific word in the wdgtStatus array by widget ID
*******************************************************************************/
/* Divide by 32 - size of the wdgtStatus word in bits to find the word index */
#define CapSense_GET_WDGT_STATUS_INDEX(wdgtId)  ((wdgtId) >> 5u)

/*******************************************************************************
* Determines the widget bitmask in wdgtStatus word by widget ID
*******************************************************************************/
/* Take the least 5 bits of widget id to find the bit number */
#define CapSense_GET_WDGT_STATUS_MASK(wdgtId)   (1Lu << ((wdgtId) & 0x1FLu))

/*******************************************************************************
* Determines the sense method of the widget
*******************************************************************************/
#if (0u != CapSense_TOTAL_CSD_WIDGETS) && (0u != CapSense_TOTAL_CSX_WIDGETS)
    #define CapSense_GET_SENSE_METHOD(ptrFlash) ((CapSense_SENSE_METHOD_ENUM)(ptrFlash)->senseMethod)
#else
    #if (0u != CapSense_TOTAL_CSX_WIDGETS)
        #define CapSense_GET_SENSE_METHOD(ptrFlash) CapSense_SENSE_METHOD_CSX_E
    #else
        #define CapSense_GET_SENSE_METHOD(ptrFlash) CapSense_SENSE_METHOD_CSD_E
    #endif /* #if (0u != CapSense_TOTAL_CSX_WIDGETS) */
#endif /* #if (0u != CapSense_TOTAL_CSD_WIDGETS) && (0u != CapSense_TOTAL_CSX_WIDGETS) */

/*******************************************************************************
* Gets the widget type
*******************************************************************************/
#define CapSense_GET_WIDGET_TYPE(ptrFlashWdgt)  ((CapSense_WD_TYPE_ENUM)((ptrFlashWdgt)->wdgtType))

/*******************************************************************************
* Gets the number of the widget's sensors
*******************************************************************************/
#define CapSense_GET_SENSOR_COUNT(widgetId)         CapSense_dsFlash.wdgtArray[(widgetId)].totalNumSns
#define CapSense_GET_SNS_CNT_BY_PTR(ptrFlashWidget) (ptrFlashWidget)->totalNumSns


/*******************************************************************************
* Increments the pointer to the Regular Filter History Object
*******************************************************************************/
#if ((0u != CapSense_REGULAR_RC_FILTER_EN) &&                                               \
     ((0u != CapSense_BUTTON_WIDGET_EN) || (0u != CapSense_SLIDER_WIDGET_EN)  ||    \
      (0u != CapSense_MATRIX_WIDGET_EN) || (0u != CapSense_TOUCHPAD_WIDGET_EN)))

    #define CapSense_INC_REG_FLTR_OBJ(fltrVariant)      \
    do {                                                        \
        (fltrVariant).ptrRegular++;                             \
    } while(0)

#else
    #define CapSense_INC_REG_FLTR_OBJ(fltrVariant)      \
        do {                                                    \
        } while(0)

#endif /* #if ((0u != CapSense_REGULAR_RC_FILTER_EN) &&
               ((0u != CapSense_BUTTON_WIDGET_EN) || (0u != CapSense_SLIDER_WIDGET_EN)  ||
                (0u != CapSense_MATRIX_WIDGET_EN) || (0u != CapSense_TOUCHPAD_WIDGET_EN))) */


/*******************************************************************************
* Increments the pointer to the Proximity Filter History Object
*******************************************************************************/
#if ((0u != CapSense_PROX_RC_FILTER_EN) && (0u != CapSense_PROXIMITY_WIDGET_EN))
    #define CapSense_INC_PROX_FLTR_OBJ(fltrVariant)     \
        do {                                                    \
            (fltrVariant).ptrProx++;                            \
        } while(0)
#else
    #define CapSense_INC_PROX_FLTR_OBJ(fltrVariant)     \
        do {                                                    \
        } while(0)
#endif /* #if ((0u != CapSense_PROX_RC_FILTER_EN) && (0u != CapSense_PROXIMITY_WIDGET_EN)) */


/*******************************************************************************
* Increments the pointer to the Filter History Object Variant
*******************************************************************************/
#define CapSense_INC_FLTR_OBJ_VARIANT(isProxHistObj, fltrVariant)   \
    do {                                                                    \
        if (0u == (isProxHistObj))                                          \
        {                                                                   \
            CapSense_INC_REG_FLTR_OBJ(fltrVariant);                 \
        }                                                                   \
        else                                                                \
        {                                                                   \
            CapSense_INC_PROX_FLTR_OBJ(fltrVariant);                \
        }                                                                   \
    } while(0)

/*******************************************************************************
* Gets a widget status in the global enable register dsRam.wdgtEnable[]
*******************************************************************************/
#if (CapSense_ENABLE == CapSense_SELF_TEST_EN)
    #define CapSense_GET_WIDGET_EN_STATUS(wdId)                                                     \
                 (CapSense_GET_WDGT_STATUS_MASK(wdId) &                                             \
                  CapSense_dsRam.wdgtEnable[CapSense_GET_WDGT_STATUS_INDEX(wdId)] &         \
                  CapSense_dsRam.wdgtWorking[CapSense_GET_WDGT_STATUS_INDEX(wdId)])
#else
    #define CapSense_GET_WIDGET_EN_STATUS(wdId)                    \
                (CapSense_GET_WDGT_STATUS_MASK(wdId) &             \
                 CapSense_dsRam.wdgtEnable[CapSense_GET_WDGT_STATUS_INDEX(wdId)])
#endif /* (CapSense_ENABLE == CapSense_SELF_TEST_EN) */

