sparkfun/Pioneer_IoT_Kit_Shield/Firmware/BLE_To_RPi/BLE_To_RPi.cydsn/Generated_Source/PSoC6/CapSense_Structure.h
/*******************************************************************************
* Gets a widget active status from the dsRam.wdgtStatus[] register
*******************************************************************************/
#define CapSense_GET_WIDGET_ACTIVE_STATUS(wdId)                    \
            (CapSense_GET_WDGT_STATUS_MASK(wdId) &                 \
             CapSense_dsRam.wdgtStatus[CapSense_GET_WDGT_STATUS_INDEX(wdId)])

/*******************************************************************************
* Declares Flash and RAM Data Structure variables
*******************************************************************************/
extern CapSense_RAM_STRUCT            CapSense_dsRam;
extern const CapSense_FLASH_STRUCT    CapSense_dsFlash;
extern const CapSense_FLASH_IO_STRUCT CapSense_ioList[CapSense_TOTAL_ELECTRODES];
extern const CapSense_RAM_WD_LIST_STRUCT CapSense_ramWidgetInit;
extern const uint8 CapSense_ramIdacInit[CapSense_TOTAL_SENSORS];

extern const CapSense_FLASH_IO_STRUCT
    CapSense_shieldIoList[CapSense_CSD_TOTAL_SHIELD_COUNT];



/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/*******************************************************************************
* High-level API
*******************************************************************************/

/**
* \if SECTION_CAPSENSE_HIGH_LEVEL
* \addtogroup group_capsense_high_level
* \{
*/

uint32 CapSense_IsAnyWidgetActive(void);
uint32 CapSense_IsWidgetActive(uint32 widgetId);
uint32 CapSense_IsSensorActive(uint32 widgetId, uint32 sensorId);

#if (0u != CapSense_MATRIX_WIDGET_EN)
    uint32 CapSense_IsMatrixButtonsActive(uint32 widgetId);
#endif /* #if (0u != CapSense_MATRIX_WIDGET_EN) */

#if (0u != CapSense_PROXIMITY_WIDGET_EN)
    uint32 CapSense_IsProximitySensorActive(uint32 widgetId, uint32 proxId);
#endif /* #if (0u != CapSense_PROXIMITY_WIDGET_EN) */

#if (0u != CapSense_SLIDER_WIDGET_EN)
    uint32 CapSense_GetCentroidPos(uint32 widgetId);
#endif /* #if (0u != CapSense_SLIDER_WIDGET_EN) */

#if (0u != CapSense_TOUCHPAD_WIDGET_EN)
    uint32 CapSense_GetXYCoordinates(uint32 widgetId);
#endif /* #if (0u != CapSense_TOUCHPAD_WIDGET_EN) */

/** \}
* \endif */

/*******************************************************************************
* Low level API
*******************************************************************************/

/**
* \if SECTION_CAPSENSE_LOW_LEVEL
* \addtogroup group_capsense_low_level
* \{
*/

cy_status CapSense_GetParam(uint32 paramId, uint32 *value);
cy_status CapSense_SetParam(uint32 paramId, uint32 value);

/** \}
* \endif
*/

/*******************************************************************************
* Function Prototypes - internal functions
*******************************************************************************/
/**
* \if SECTION_CAPSENSE_INTERNAL
* \addtogroup group_capsense_internal
* \{
*/



void CapSense_DsInitialize(void);
#if (0u != CapSense_ADC_EN)
    void CapSense_AdcDsInitialize(void);
#endif /* (0u != CapSense_ADC_EN) */

/** \}
* \endif */

#endif /* End CY_CAPSENSE_CapSense_STRUCTURE_H */

/* [] END OF FILE */
